pub fn normalize_text(s: &str) -> String {
    s.chars()
        .map(|c| match c {
            'ᴀ' | 'ą' => 'a',
            'ʙ' => 'b',
            'ᴄ' | 'ć' => 'c',
            'ᴅ' => 'd',
            'ᴇ' | 'ę' => 'e',
            'ғ' => 'f',
            'ɢ' => 'g',
            'ʜ' => 'h',
            'ɪ' => 'i',
            'ᴊ' => 'j',
            'ᴋ' => 'k',
            'ʟ' | 'ł' => 'l',
            'ᴍ' => 'm',
            'ɴ' | 'ń' => 'n',
            'ᴏ' | 'ó' => 'o',
            'ᴘ' => 'p',
            'ǫ' => 'q',
            'ʀ' => 'r',
            's' | 'ś' => 's',
            'ᴛ' => 't',
            'ᴜ' => 'u',
            'ᴠ' => 'v',
            'ᴡ' => 'w',
            'x' => 'x',
            'ʏ' => 'y',
            'ᴢ' | 'ź' | 'ż' => 'z',
            _ => c.to_ascii_lowercase(),
        })
        .collect()
}